PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
///* Read/Write SPR helpers */
//static inline uint32_t mfspr(uint32_t spr)
//{
//    uint32_t val;
//    __asm__ volatile ("mfspr %0,%1" : "=r"(val) : "i"(spr));
//    return val;
//}
//
//static inline void mtspr(uint32_t spr, uint32_t val)
//{
//    __asm__ volatile ("mtspr %0,%1" :: "i"(spr), "r"(val));
//}
//
///**
// * Invalidate the entire D-cache; all tags/cache lines are invalidated.\n
// *   D-cache invalidation is required, whenever the contents of the background memory
// * change for reasons not being loads and stores by the CPU, e.g., erasure or programming
// * of the flash array.
// */
//// TODO Onve this function is validated, we should better use it once after erasure than
//// using invalidateDCache prior to each quad-page blank-check.
//static inline void invalidateDCacheFull(void)
//{
//    // TODO This function is not tested yet. Compare with proven assembly code in startup.S
//    // and rtos_ivorHandler.S. A difference is the handling of the abort flag. Is the use
//    // of instruction and data load/store synchronization instructions identical?
//
//    #define SPR_L1CSR0   1010u      /* Register SPR1010 is L1 cache control an status. */
//    #define L1CSR0_DCE   (1u << 0)  /* Register bit L1CSR0[DCE], Data Cache Enable. */
//    #define L1CSR0_CINV  (1u << 1)  /* Register bit L1CSR0[CINV], Data Cache Invalidate. */
//
//    /* Flush data fetch and store operations. Down here and until completion of the cache
//       invalidation, we should better not use the RAM. */
//    // TODO Check if RAM is usable during invalidation. Otherwise we would at least need to
//    // suspend IRQ handling. And using assembly code would in this case be the only
//    // guarantee.
//#if 0
//Some first information seems to prove the doubts on using RAM:
//
//Where this is stated in the manuals (and how to find it)
//
//
//e200z4 Core Reference Manual (e200z4RM)
//The behavior is described in the cache section that documents the L1 Cache Control and Status Register (L1CSR0) and cache maintenance operations (chapter "L1 Cache Control and Status Registers (L1CSR0, L1CSR1)" and the cache invalidation subsection). The manual explains that CINV is self-clearing and that the cache is busy during invalidation. You can find these registers in section 2.4.14 of the e200z4RM PDF; search that PDF for "L1CSR0" and "CINV". [usermanual.wiki]
//
//
//Exact wording (as quoted by NXP support from the core RM):
//
//"During the process of performing the invalidation, a cache does not respond to accesses that are not snoop accesses and remains busy. Interrupts may still be recognized and processed, potentially aborting the invalidation operation."
//Additionally, the same reply notes:
//"Once set, hardware clears L1CSR0[CINV] after ~134 CPU cycles. During this time, CPU waits for cache invalidation to complete. Code is not executed. Software should poll L1CSR0[CINV] until it is cleared."
//(NXP staff quoting the core RM in an official forum answer.) [community.nxp.com], [community.nxp.com]
//
//
//Closely related e200 manuals (e200z6 RM) describe the same mechanism and the need to treat the cache as busy / non-responsive to normal accesses during the invalidate/maintenance window; see the L1 Cache Control and Status Register (L1CSR0) and Cache Invalidation sections. Although this is the z6 variant, the invalidate semantics match what NXP states for z4/z7. [yumpu.com], [yumpu.com]
//
//This means effectively that it is not reliably possible to implent this in C. The keyword register is a recommendation only but no guarantee that no RAM is used. We can write a C function frame wrapper around the code existing in the RTOS, rtos_ivorHandler.S.
//#endif
//
//    __asm__ volatile ("msync");
//
//    /* Request global invalidate by setting L1CSR0[CINV]. */
//    register uint32_t l1csr0 = mfspr(SPR_L1CSR0);
//    l1csr0 |= L1CSR0_CINV;
//    mtspr(SPR_L1CSR0, l1csr0);
//
//    /* Invalidate instruction pipeline, force re-reading the instructions. */
//    __asm__ volatile ("isync");
//
//    /* Wait for cache invalidate to complete. (Bit L1CSR0[CINV] clears when done.) */
//    do
//    {
//        l1csr0 = mfspr(SPR_L1CSR0);
//    }
//    while((l1csr0 & L1CSR0_CINV) != 0u);
//
//    __asm__ volatile ("isync");
//
//    #undef SPR_L1CSR0
//    #undef L1CSR0_DCE
//    #undef L1CSR0_CINV
//} /* invalidateDCacheFull */


/**
 * Invalidate the D-cache for all addresses, which belong to a given quad-page.\n
 *   D-cache invalidation is required, whenever the contents of the background memory
 * change for reasons not being loads and stores by the CPU, e.g., erasure or programming
 * of the flash array.
 *   @param[in] addrOfQuadPage
 * The address of the quad-page.
 */
static inline void invalidateDCache(uint32_t addrOfQuadPage)
{
    /* Address doesn't need to be forced to have the alignment of a cache line; quad-page
       have the even higher alignment constraint. We jsut check by assertion. */
    assert(EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(addrOfQuadPage) == 0u);

#if defined(MCU_MPC5748G)
    /* The e200z4204n3 core's line size, see RM48 62.7.1, p.3111. */
    const uint32_t sizeofCacheLine = 32u;
#elif defined(MCU_MPC5775B) || defined(MCU_MPC5775E)
# error Specify cache line size for MPC5775B/E
#elif defined(MCU_MPC5777C)
# error Specify cache line size for MPC5777C
#endif

    uint32_t msr = rtos_osEnterCriticalSection();

    /* Flush data fetch and store operations. */
    __asm__ volatile ("msync");

    /* A quad-page of 128 Byte means four possible tag hits in the cache. */
    __asm__ volatile ("dcbi 0,%0" :: "r"(addrOfQuadPage + 0u*sizeofCacheLine));
    __asm__ volatile ("dcbi 0,%0" :: "r"(addrOfQuadPage + 1u*sizeofCacheLine));
    __asm__ volatile ("dcbi 0,%0" :: "r"(addrOfQuadPage + 2u*sizeofCacheLine));
    __asm__ volatile ("dcbi 0,%0" :: "r"(addrOfQuadPage + 3u*sizeofCacheLine));

    /* Force re-fill of all pipelines after cache manipulation. */
    __asm__ volatile ("msync");
    __asm__ volatile ("se_isync");

