PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
    /* To initiate programming, no other operation must be in progress. */
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK     \
                                 |C55FMC_MCR_PGM_MASK    \
                                 |C55FMC_MCR_EHV_MASK    \
                                 |C55FMC_MCR_PSUS_MASK   \
                                 |C55FMC_MCR_ESUS_MASK   \
                                )
    else if((mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_CLEARED
    {
//        /* Erasure of the flash array has not been done in sync with the D-cache contents.
//           Reading of the flash will not surely return the values, which are now physically
//           in the flash array. Before we can do a reliable blanks test, we need to
//           invalidate all data, which is cached for the addreses of the quad-page. */
//        invalidateDCache(pPrgDataBuf->address);

        if(!isQuadPageBlank(pPrgDataBuf->address))
            retCode = rom_err_quadPageNotBlank;
        else
        {
            /* Enable the flash block for programming, which the wanted quad-page sits in. */
            enableFlashBlocks( pPrgDataBuf->address
                             , EAP_C55FMC_SIZE_OF_QUAD_PAGE
                             , /*isErase*/ false
                             );

            /* Set MCR[PGM] to start program operation. */
            C55FMC->MCR |= C55FMC_MCR_PGM_MASK;

            /* We always write an entire quad-page at once. */

            /* Copy quad-page contents into the controller's data buffer. This is at the
               same time the required interlock write. */
            const uint32_t *pRd = &pPrgDataBuf->data_u32[0];
            volatile uint32_t *pWr = (volatile uint32_t*)pPrgDataBuf->address;

            _Static_assert(EAP_C55FMC_SIZE_OF_QUAD_PAGE % 4u == 0u, "Bad configuration");
            for(unsigned int u=0u; u<EAP_C55FMC_SIZE_OF_QUAD_PAGE/4u; ++u)
                * pWr++ = * pRd++;

            /* After filling the write buffer, we set MCR[EHV] to turn on the high voltage
               for flashing. See RM48, 74.5.1, p.3656. */
            C55FMC->MCR |= C55FMC_MCR_EHV_MASK;

            /* Save the reference to the input data buffer; we still need it at the end for a
               verify. */
            _pPrgDataBuf = pPrgDataBuf;

            /* This is a non-blocking function. We don't wait for the result but will check
               it in the next clock tick. */
            retCode = rom_err_processPending;

        } /* if(Quad-page is erased?) */
    }
    else
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        abortEraseAndProgram();

        retCode = rom_err_unexpectedHwState;
    }

    return retCode;

} /* eap_osStartProgramQuadPage */


/**
 * Check the status of a programming operation, which had been initiated before by
 * eap_osStartProgramQuadPage().
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 */
rom_errorCode_t eap_osGetStatusProgramQuadPage(void)
{
    rom_errorCode_t retCode;

    /* There must be a program operation but no suspend or erase visible. */
    const uint32_t mcr = C55FMC->MCR;
    #define BITS_TO_BE_SET      (C55FMC_MCR_PGM_MASK|C55FMC_MCR_EHV_MASK)
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK|C55FMC_MCR_PSUS_MASK|C55FMC_MCR_ESUS_MASK)
    if((mcr & BITS_TO_BE_SET) == BITS_TO_BE_SET  &&  (mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_SET
    #undef BITS_TO_BE_CLEARED
    {
        /* Check MCR[DONE]. 1 means operation done. */
        if((mcr & C55FMC_MCR_DONE_MASK) != 0u)
        {
            /* Check MCR[PEG]. A zero bit indicates a programming error. */
            if((mcr & C55FMC_MCR_PEG_MASK) != 0u)
                retCode = rom_err_noError;
            else
                retCode = rom_err_c55FmcErrorInPeg;
        }
        else
        {
            /* MCR[DONE]=0: The operation is still in progress. We wait till next clock
               tick for the next check. */
            retCode = rom_err_processPending;
        }
    }
    else
        retCode = rom_err_unexpectedHwState;

    if(retCode != rom_err_processPending)
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        abortEraseAndProgram();

        /* Before we continue with the verify, we invalidate all quad-page addresses in the
           D-cache - without we would likely not read the bytes physcally programmed in the
           flash array but the still cached data from the interlock writes, and verify
           would then always succeed. */
        invalidateDCache(_pPrgDataBuf->address);

        /* After terminating high voltage and programming mode, the data from the partition
           is again readable and we can verify the programming result. */
        if(retCode == rom_err_noError  && !verifyQuadPage(_pPrgDataBuf))
            retCode = rom_err_verifyFailed;
    }

    return retCode;

} /* eap_osGetStatusProgramQuadPage */


/***************************** Test, temporary code ******************/
//
//#include "stm_systemTimer.h"
//
//eap_quadPageProgramBuffer_t BSS_OS(eap_prgDataBuf) =
//{
//    .address = 0u,
//    .data_b =
//    {
//        [0 ... (EAP_C55FMC_SIZE_OF_QUAD_PAGE-1u)] = 0u,
//    },
//};
//unsigned int eap_noWaitCyclesErase = 0u
//           , eap_noWaitCyclesPgm = 0u
//           , eap_cntFsm = 0u;
//rom_errorCode_t eap_resultStartErase = rom_err_invalidErrorCode
//              , eap_resultGetStatusErase = rom_err_invalidErrorCode
//              , eap_resultStartPgm = rom_err_invalidErrorCode
//              , eap_resultGetStatusPgm = rom_err_invalidErrorCode;
//uint32_t eap_tiPgmQuadPageIn12p5ns = UINT32_MAX;
//
///** Return true if state machine requires continued calling for completing the process. */
//bool eap_firstTest(bool start)
//{
//    static enum {idle, init, error, waitForErase, program, success, } state_ SECTION(.sdata.OS.var) = idle;
//
//    if(start)
//    {
//        assert(state_ == idle  ||  state_ == success);
//        state_ = init;
//    }
//    else
//        assert(state_ == waitForErase  ||  state_ == program);
//
//    if(state_ == init)
//    {
//        eap_cntFsm = 0u;
//        eap_prgDataBuf.address = 0xFC0100u;
//        static uint8_t SDATA_OS(startVal_) = 1u;
//        for(unsigned int u=0u; u<EAP_C55FMC_SIZE_OF_QUAD_PAGE; ++u)
//            eap_prgDataBuf.data_b[u] = (startVal_ + u) & 0xFFu;
//        ++ startVal_;
//
//        eap_resultStartErase = eap_osStartEraseFlashBlocks( eap_prgDataBuf.address
//                                                          , EAP_C55FMC_SIZE_OF_QUAD_PAGE
//                                                          );
//        if(eap_resultStartErase == rom_err_processPending)
//        {
//            eap_noWaitCyclesErase = 0u;
//            state_ = waitForErase;
//        }
//        else
//            state_ = error;
//    }
//    else if(state_ == waitForErase)
//    {
//        ++ eap_noWaitCyclesErase;
//        eap_resultGetStatusErase = eap_osGetStatusEraseFlashBlocks();
//
//        if(eap_resultGetStatusErase == rom_err_noError)
//            state_ = program;
//        else if(eap_resultGetStatusErase != rom_err_processPending)
//            state_ = error;
//    }
//    else if(state_ == program)
//    {
//        eap_tiPgmQuadPageIn12p5ns = stm_osGetSystemTime(/*idxTimer*/ 0u);
//        eap_resultStartPgm = eap_osStartProgramQuadPage(&eap_prgDataBuf);
//
//        if(eap_resultStartPgm == rom_err_processPending)
//        {
//            eap_noWaitCyclesPgm = 0u;
//            while(true)
//            {
//                eap_resultGetStatusPgm = eap_osGetStatusProgramQuadPage();
//                if(eap_resultGetStatusPgm == rom_err_processPending)
//                    ++ eap_noWaitCyclesPgm;
//                else
//                {
//                    if(eap_resultGetStatusPgm == rom_err_noError)
//                        state_ = success;
//                    else
//                        state_ = error;
//
//                    break;
//                }
//            }
//            eap_tiPgmQuadPageIn12p5ns = stm_osGetSystemTime(/*idxTimer*/ 0u)
//                                        - eap_tiPgmQuadPageIn12p5ns;
//        }
//        else
//        {
//            state_ = error;
//            eap_tiPgmQuadPageIn12p5ns = stm_osGetSystemTime(/*idxTimer*/ 0u)
//                                        - eap_tiPgmQuadPageIn12p5ns;
//        }
//    }
//
//    return state_ != error  &&  state_ != success;
//}
#endif /* TEST_WITH_MOCKUP */
